Австралия/src/Catalogs/FixedAssets/FixedAssets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FixedAssets</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.FixedAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DepreciationAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DepreciationMethod</name>
    <type>
      <types>EnumRef.FixedAssetDepreciationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>InitialCost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MeasurementUnit</name>
    <type>
      <types>CatalogRef.UOMClassifier</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/FixedAssets/FixedAssets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>FixedAssets</name>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Depreciation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FixedAsset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Catalogs/DefaultGLAccounts/DefaultGLAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultGLAccounts</name>
  <predefined>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
    </items>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
    </items>
    <items>
      <name>AdvanceHolders</name>
      <description>Advance holders</description>
    </items>
    <items>
      <name>AdvanceHoldersPayable</name>
      <description>Advance holders payable</description>
    </items>
    <items>
      <name>AdvancesToSuppliers</name>
      <description>Advances to suppliers</description>
    </items>
    <items>
      <name>BankAccount</name>
      <description>Bank account</description>
    </items>
    <items>
      <name>BankFeesCreditAccount</name>
      <description>Bank fees credit account</description>
    </items>
    <items>
      <name>BankFeesExpenseAccount</name>
      <description>Bank fees expense account</description>
    </items>
    <items>
      <name>CapitalIntroduction</name>
      <description>Capital introduction</description>
    </items>
    <items>
      <name>CashAccount</name>
      <description>Cash account</description>
    </items>
    <items>
      <name>CommissionExpensesOnLoansBorrowed</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>CommissionIncomeOnLoansLent</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Cost of sales</description>
    </items>
    <items>
      <name>CreditCardSalesReceivedAtALaterDate</name>
      <description>Credit card sales received at a later date</description>
    </items>
    <items>
      <name>CustomerAdvances</name>
      <description>Customer advances</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
    </items>
    <items>
      <name>FixedAssetsDepreciation</name>
      <description>Fixed assets depreciation</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeGain</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeLoss</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>FundsTransfersBeingProcessed</name>
      <description>Funds transfers being processed</description>
    </items>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>IncomeSummary</name>
      <description>Income summary</description>
    </items>
    <items>
      <name>InterestExpensesOnLoansBorrowed</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>InterestPayable</name>
      <description>Interest payable</description>
    </items>
    <items>
      <name>InterestReceivable</name>
      <description>Interest receivable</description>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
    </items>
    <items>
      <name>LoansBorrowed</name>
      <description>Loans borrowed</description>
    </items>
    <items>
      <name>LoansLentToCounerparty</name>
      <description>Loans lent to counterparty</description>
    </items>
    <items>
      <name>LoansLentToEmployee</name>
      <description>Loans lent to employee</description>
    </items>
    <items>
      <name>OpeningBalanceEquity</name>
      <description>Opening balance equity account (to balance opening entries)</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollPayable</name>
      <description>Payroll payable</description>
    </items>
    <items>
      <name>PettyCashAccount</name>
      <description>Petty cash account</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>RetailMarkup</name>
      <description>Retail markup for retail inventory method</description>
    </items>
    <items>
      <name>TaxPayable</name>
      <description>Tax payable</description>
    </items>
    <items>
      <name>TaxRefund</name>
      <description>Tax refund</description>
    </items>
    <items>
      <name>VATInput</name>
      <description>VAT input</description>
    </items>
    <items>
      <name>VATAdvancesToSuppliers</name>
      <description>VAT on advance payments paid to suppliers</description>
    </items>
    <items>
      <name>VATAdvancesFromCustomers</name>
      <description>VAT on advance payments received from customers</description>
    </items>
    <items>
      <name>VATOutput</name>
      <description>VAT output</description>
    </items>
    <items>
      <name>VATReverseCharge</name>
      <description>VAT reverse charge</description>
    </items>
    <items>
      <name>WorkInProgress</name>
      <description>Work-in-progress</description>
    </items>
    <items>
      <name>WriteOffOverUnderMOHToCOGS</name>
      <description>Write-off over/underallocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/FixedAssets/Forms/GLAccountsEditForm/Module.bsl
#Region GeneralPurposeProceduresAndFunctions

// Function checks GL account change option.
//
&AtServer
Function CancelGLAccountChange(MessageText)
	
	Query = New Query(
	"SELECT ALLOWED
	|	FixedAssets.Period,
	|	FixedAssets.Recorder,
	|	FixedAssets.LineNumber,
	|	FixedAssets.Active,
	|	FixedAssets.RecordType,
	|	FixedAssets.Company,
	|	FixedAssets.FixedAsset,
	|	FixedAssets.Cost,
	|	FixedAssets.Depreciation,
	|	FixedAssets.ContentOfAccountingRecord
	|FROM
	|	AccumulationRegister.FixedAssets AS FixedAssets
	|WHERE
	|	FixedAssets.FixedAsset = &FixedAsset");
	
	Query.SetParameter("FixedAsset", ?(ValueIsFilled(Ref), Ref, Undefined));
	
	Result = Query.Execute();
	
	Return Not Result.IsEmpty();
	
EndFunction

&AtClient
Procedure NotifyAboutSettlementAccountChange()
	
	ParameterStructure = New Structure("GLAccount, DepreciationAccount", GLAccount, DepreciationAccount);
	Notify("AccountsChangedFixedAssets", ParameterStructure);
	
EndProcedure

#EndRegion

#Region ProcedureFormEventHandlers

// Procedure - event handler OnCreateAtServer of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	GLAccount = Parameters.GLAccount;
	DepreciationAccount = Parameters.DepreciationAccount;
	
	If CancelGLAccountChange(Ref) Then
		Items.GLAccountsGroup.ToolTip = NStr("en = 'Records are registered for this capital asset in the infobase. Cannot change the GL account.'; ru = 'В базе есть движения по этому внеоборотному активу! Изменение счетов учета запрещено!';pl = 'W bazie informacyjnej są zarejestrowane wpisy dla tego zasobu kapitałowego. Nie można zmienić konta ewidencji';es_ES = 'Grabaciones se han guardado para este activo de capital en la infobase. No se puede cambiar la cuenta del libro mayor.';es_CO = 'Grabaciones se han guardado para este activo de capital en la infobase. No se puede cambiar la cuenta del libro mayor.';tr = 'Veritabanında bu kasa için kayıtlar kaydedilir. Muhasebe hesabı değiştirilemez.';it = 'Nell''infobase ci sono registrazioni registrate per questo capitale fisso. Impossibile modificare il conto mastro.';de = 'Für dieses Kapitalvermögen werden in der Infobase Aufzeichnungen registriert. Das Hauptbuch-Konto kann nicht geändert werden.'");
		Items.GLAccountsGroup.Enabled = False;
		Items.Default.Visible = False;
	EndIf;
	
EndProcedure

#EndRegion

#Region ProcedureActionsOfTheFormCommandPanels

// Procedure - command click handler Default.
//
&AtClient
Procedure Default(Command)
	
	DefaultAtServer();
	NotifyAboutSettlementAccountChange();
	
EndProcedure

&AtServer
Procedure DefaultAtServer()
	
	GLAccount			= GetDefaultGLAccount("FixedAssets");
	DepreciationAccount	= GetDefaultGLAccount("FixedAssetsDepreciation");
	
EndProcedure

&AtServerNoContext
Function GetDefaultGLAccount(Account)
	Return Catalogs.DefaultGLAccounts.GetDefaultGLAccount(Account);
EndFunction

&AtClient
Procedure GLAccountOnChange(Item)
	
	If NOT ValueIsFilled(GLAccount) Then
		GLAccount = GetDefaultGLAccount("FixedAssets");
	EndIf;
	
	NotifyAboutSettlementAccountChange();
	
EndProcedure

&AtClient
Procedure DepreciationAccountOnChange(Item)

	If NOT ValueIsFilled(DepreciationAccount) Then
		DepreciationAccount = GetDefaultGLAccount("FixedAssetsDepreciation");
	EndIf;
	
	NotifyAboutSettlementAccountChange();
	
EndProcedure

#EndRegion
